Repository: m1ra7/dna_analyse
Catalog: lib/l10n/intl_*.arb
Languages: tr

# homescreenTitle
source: Homepage
tr: Ana Sayfa

# settingsTitle
source: Settings
tr: Ayarlar

# helloScreen
source: Welcome
tr: Merhaba

source: Basic Health Measurements
tr: Temel Sağlık Ölçümleri

# generalProfile
source: General Health Profile
tr: Genel Sağlık Profili

# healthText
source: Your health is in your hands! You can make a big difference with small steps.
tr: Sağlığın senin elinde! Küçük adımlarla büyük fark yaratabilirsin.

# skorInfo
source: • Excellent (80-100) • Good (60-79) • Average (40-59) • Not Good (20-39) • Poor (0-19)
tr: • Mükemmel (80-100) • İyi (60-79) • Ortalama (40-59) • İyi değil (20-39) • Kötü (0-19)

# motiv
source: Your Health is Our Top Priority.
tr: Sağlığınız ilk Önceliğimizdir.

# kardiyovaskuler
source: Cardiovascular
tr: Kardiyovasküler

# norolojik
source: Neurological
tr: Nörolojik

# metabolizma
source: Metabolism
tr: Metabolizma

# bagisiklik
source: Immune System
tr: Bağışıklık

# testTitle
source: Create Dna Analysis
tr: Test Yap

# barItem2
source: Results
tr: Sonuclar

# barItem3
source: Medication
tr: İlaç Takipi

# geneticTraitsDescription
source: Genetic traits are physical, biological, and sensory characteristics inherited from DNA.
tr: Genetik özellikler, DNA’dan gelen fiziksel, biyolojik ve duyusal özelliklerdir.

source: Taste Perception
tr: Tat Algısı

source: Circadian Rhythm
tr: Sirkadiyen Ritim

source: Color Vision
tr: Renk Görüşü

source: Muscle Strength
tr: Kas Gücü

source: Pain Perception
tr: Ağrı Algısı

source: Immune System Strength
tr: Bağışıklık Sistemi Gücü

source: Personal Information
tr: Kişisel Bilgiler

# firstName
source: Name
tr: İsim

# lastName
source: Surname
tr: Soyisim

source: Age
tr: Yaş

source: Gender
tr: Cinsiyet

source: Ethnicity
tr: Etnik Köken

source: Current Medications
tr: Mevcut İlaçlar

source: Medical History
tr: Medikal Geçmiş

source: Family History
tr: Aile Geçmişi

source: Blood Type
tr: Kan Grubu

source: Height
tr: Boy (cm)

source: Weight
tr: Kilo (kg)

source: Hair Color
tr: Saç Rengi

source: Eye Color
tr: Göz Rengi

source: Allergies
tr: Alerjiler

source: Health Risks
tr: Sağlık Riskleri

# recommendedMedications
source: Preventive Medications
tr: Önleyici İlaçlar

source: Preventive Measures
tr: Önleyici Tedbirler

source: Health Risk Assessment
tr: Sağlık Risk Değerlendirmesi

source: High-Risk Area
tr: Riskli Bölge

source: Body Mass Index
tr: Vücut Kitle İndeksi

source: Blood Pressure
tr: Tansiyon

source: Cholesterol
tr: Kolesterol

source: Physical Condition
tr: Fiziksel Kondisyon

source: Blood Sugar
tr: Kan Şekeri

source: Sleep Quality
tr: Uyku Kalitesi

# diseaseRisks
source: Disease Risk Assessment
tr: Hastalık Risk Değerlendirmesi

source: Rheumatoid Arthritis
tr: Romatoid Artrit

source: Alzheimer's Disease
tr: Alzheimer Hastalığı

source: Colorectal Cancer
tr: Kolorektal Kanser

source: Type 2 Diabetes
tr: Tip 2 Diyabet

source: Cardiovascular Disease
tr: Kardiyovasküler Hastalık

source: Strength
tr: Güç

source: Flexibility
tr: Esneklik

source: Power
tr: Kuvvet

source: Endurance
tr: Dayanıklılık

source: Fitness Profile
tr: Fitness Profili

source: Muscle Fiber Composition
tr: Kas Lifi Bileşimi

source: Fast Twitch
tr: Hızlı Seğirme

source: Slow Twitch
tr: Yavaş Seğirme

source: Muscle Composition
tr: Kas Kompozisyonu

source: Vitamin & Mineral Needs
tr: Vitamin & Mineral İhtiyaçları

source: Nutrition Overview
tr: Beslenmeye Genel Bakış

source: Metabolic Profile
tr: Metabolizma Profili

source: Type
tr: Tip

source: Ratio
tr: Oran

source: Recommended Diet
tr: Önerilen Diyet

source: Mineral Needs
tr: Mineral İhtiyaçları

source: Vitamin Needs
tr: Vitamin İhtiyaçları

source: Caloric Need
tr: Kalori İhtiyacı

source: Maintenance
tr: Koruma (Bakım)

source: Weight Loss
tr: Kilo Kaybı

source: Weight Gain
tr: Kilo Alma

source: Recommendations
tr: Öneriler

# geneticTitle
source: Genetic
tr: Genetik

# healthTitle
source: Health
tr: Sağlık

# nutritionTitle
source: Nutrition
tr: Beslenme

# fitnessTitle
source: Stay Fit
tr: Fit Kalma

# medicineTitle
source: Medicine Tracking
tr: İlaç Takipi

source: Total
tr: Toplam

source: Taken
tr: Alınan

source: Upcoming
tr: Yaklaşan

source: Missed
tr: Kaçırılan

# deleteMedicineTitle
source: Delete Medicine
tr: İlaç Sil

# deleteMedicineConfirmation
source: Are you sure you want to delete this medicine?
tr: Bu ilacı silmek istediğinize emin misiniz?

source: Cancel
tr: İptal

source: Delete
tr: Sil

source: Edit
tr: Düzenle

source: Basic Information
tr: İlaç Bilgisi

source: Medicine Name
tr: İlaç Adı

source: Dosage
tr: Doz

source: Start Date
tr: Başlangıç Tarihi

source: Intake Time
tr: Alım Saati

source: Notes
tr: Notlar

source: Today's Overview
tr: Bugünün Özeti

source: Search medicine...
tr: İlaç ara...

source: Add Medicine Image
tr: İlaç Resmi Ekle

source: Medicine Details
tr: İlaç Detayları

source: Unit
tr: Birim

source: Schedule and Reminders
tr: Program ve Hatırlatıcılar

source: Frequency
tr: Sıklık

source: Times
tr: Zamanlar

source: Add Time
tr: + Zaman Ekle

source: End Date (optional)
tr: Bitiş Tarihi (isteğe bağlı)

source: Select
tr: Seçin

source: Reminder Settings
tr: Hatırlatma Ayarları

# notesHint
source: Add additional notes or instructions about this medicine
tr: Bu ilaç hakkında ek notlar veya talimatlar ekleyin

source: Update
tr: Güncelle

source: Save Medicine
tr: İlacı Kaydet

source: Edit Medicine
tr: İlacı Düzenle

source: Add New Medicine
tr: Yeni İlaç Ekle

source: Once daily
tr: Günde bir kez

source: Twice daily
tr: Günde iki kez

source: Three times daily
tr: Günde üç kez

source: Four times daily
tr: Günde dört kez

source: Once weekly
tr: Haftada bir kez

source: Once monthly
tr: Ayda bir kez

source: Please Enter Medicine Name!
tr: Lütfen ilaç adını girin!

source: Please Enter Dosage!
tr: Lütfen doz miktarını girin!

source: please Select Unit!
tr: Lütfen birim seçin!

source: Please select frequency
tr: Lütfen sıklık seçin

# medicineNotesHint
source: Add additional notes or instructions about this medicine
tr: Bu ilaç hakkında ek notlar veya talimatlar ekleyin

source: Daily
tr: Günde

source: End Date
tr: Biriş Tarihi

# dnaAnalysisTitle
source: DNA Analysis
tr: DNA Analiziniz

# dnaAnalysisDesc
source: Discover your unique genetic makeup with our cutting-edge analysis technology.
tr: Son teknoloji analiz teknolojimizle benzersiz genetik yapınızı keşfedin.

# healthDesc
source: Discover your genetic structure and get to know your health more closely. Learn about your disease predispositions through your DNA analysis and receive personalized health recommendations.
tr: Genetik yapınızı keşfedin, sağlığınızı daha yakından tanıyın. DNA analizinizle hastalıklara yatkınlıklarınızı öğrenin ve kişiselleştirilmiş sağlık önerileri alın.

# fitnessDesc
source: Thanks to your DNA analysis, learn about your genetic disease risks, vitamin and mineral deficiencies, and the most suitable exercises and medications for your body. Live a more conscious and healthy life with health advice tailored to your genetic makeup.
tr: DNA analiziniz sayesinde genetik hastalık risklerinizi, vitamin ve mineral eksikliklerinizi, vücudunuza en uygun egzersiz ve ilaçları öğrenin. Genetik yapınıza özel sağlık tavsiyeleriyle daha bilinçli ve sağlıklı bir yaşam sürün.

# letUsKnowYou
source: Let's get to know you
tr: Sizi Tanıyalım

# authNameTitle
source: Your Name
tr: Adınız

source: What is your name?
tr: Adınız nedir?

# authAgeTitle
source: Age
tr: Yaş

# whatIsYourAge
source: How old are you?
tr: Yaşınızı seçiniz

# authAgeHint
source: Select your age
tr: Kaç Yaşındasınız?

# authPasswordTitle
source: Password
tr: Şifre

# createPassword
source: Create your password
tr: Şifrenizi oluşturun

# enterPassword
source: Please enter your password
tr: Lütfen şifrenizi girin

# invalidPassword
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalı

# authEmailTitle
source: Email
tr: E-posta

# authNameHint
source: Enter Your Name
tr: Adınızı Giriniz

# invalidEmail
source: Please enter a valid email address
tr: Lütfen geçerli bir e-posta adresi girin

# whatIsYourEmail
source: What is your email address?
tr: E-posta adresiniz nedir?

# passwordCon
source: Enter your password
tr: Şifrenizi tekrar girin

# healthAssessmentTitle
source: Your Health Assessment
tr: Sağlık Değerlendirmeniz

# healthAssessmentDescription
source: Your health has been assessed as {healthyPercent}% healthy and {riskPercent}% at risk. To reduce this risk, the following practices are recommended.
tr: Sağlığınızın {healthyPercent}% oranında sağlıklı ve {riskPercent}% oranında risk altında olduğu belirlenmiştir. Bu riski azaltmak için aşağıdaki uygulamaları yapmanız önerilmektedir.

source: Genetic Risk Factors
tr: Genetik Risk Faktörleri

source: Risk Distribution
tr: Risk Dağılımı

# riskText
source: {riskName} risk: {value}%
tr: {riskName} riski: {value}%

# heartRisk
source: Heart
tr: Kalp

# diabetesRisk
source: Diabetes
tr: Diyabet

# cancerRisk
source: Cancer
tr: Kanser

# obesityRisk
source: Obesity
tr: Obezite

# healthStatisticsReview
source: Review Health Statistics
tr: Sağlık İstatistiklerini İncele

# medicationsAndImportanceReview
source: Review Medications and Their Importance
tr: İlaçları ve Önemlerini İncele

source: Results
tr: Sonuçlar

source: Your Health Status
tr: Sağlık Durumunuz

# quickActions
source: Menu
tr: Menü

source: Genetics
tr: Genetik

source: Health
tr: Sağılık

source: Nutrition
tr: Beslenme

source: Recent Activity
tr: Son Aktivite

source: Food Sensitivities
tr: Gıda Hassasiyetleri

source: Nutritional Recommendations
tr: Beslenme Önerileri

# healthStatusBasedOnRisk
source: According to your risk analysis, your health status:
tr: Risk analizinize göre sağlık durumunuz

source: Risk level:
tr: Risk seviyesi:

source: DNA Overview
tr: DNA'ya Genel Bakış

# laterIdentifiedItems
source: Later added items:
tr: Sonradan eklenenler

source: Medications to be used:
tr: Kullanılması gereken İlaçlar

# healthAnalysis
source: Analyzes your health status and potential risks
tr: Sağlık durumunuzu ve olası riskleri analiz eder

# analysisTypeSelection
source: Select what type of information from the DNA sequence you want to analyze.
tr: DNA dizisinden hangi tür bilgiyi analiz etmek istediğinizi seçin.

# geneticPredispositions
source: Comprehensive analysis of your genetic code to identify important variants.
tr: Önemli genetik varyantları belirlemek için DNA kodunuzun kapsamlı analizi

# personalizedDiet
source: Determines personalized diet and nutrition recommendations.
tr: Kişiye özel diyet ve beslenme önerileri belirler.

# exerciseRecommendations
source: Determines exercise types suitable for genetic makeup.
tr: Genetik yapıya uygun egzersiz tiplerini belirler.

source: Select Analysis Types
tr: Analiz Türlerini Seçin

source: Tracking Medication
tr: İlaç Takibi

# RecommendedMeds
source: Recommended Medications:
tr: Önerilen İlaçlar

source: Preventive Measures:
tr: Alınabilecek Önlemler

# NoRecommendation
source: No medication or preventive measure recommended.
tr: Herhangi bir ilaç ya da önlem önerilmedi.

# MedicationAndMeasuresHelp
source: These medications and measures help protect your health and reduce risks.
tr: Bu ilaçlar ve önlemler, sağlığınızı korumaya ve riskleri azaltmaya yardımcı olur.

source: Medications and Measures
tr: İlaçlar ve Önlemler

source: DNA Analysis Form
tr: DNA Analiz Formu

# EnterDNASequence
source: DNA Sequence
tr: DNA Sekansı

source: Current Medications
tr: Mevcut ilaçlar

source: Medical History
tr: Tıbbi Geçmiş

source: Gender
tr: Cinsiyet

source: Man
tr: Erkek

source: Woman
tr: Kadın

# SelectBloodType
source: Select Your Blood Type
tr: Kan Grubu

source: Submit Analysis
tr: Analizleri Gönder

source: Summary
tr: Özet

source: DNA Analysis Report
tr: DNA Analiz Raporu

# ComprehensiveGeneticResults
source: Comprehensive genetic analysis results
tr: Kapsamlı genetik analiz sonuçları

source: Analysis Name:
tr: Analiz Adı:

source: Sequence Length:
tr: Dizi Uzunluğu:

source: base pairs
tr: baz çifti

source: Reference Number:
tr: Referans Numarası:

source: Technology Used:
tr: Kullanılan Teknoloji:

source: Created Date:
tr: Oluşturulma Tarihi:

source: Lab Name:
tr: Laboratuvar Adı:

source: Analysis Types:
tr: Analiz Türleri:

source: Key Findings:
tr: Önemli Bulgular:

source: Health Overview
tr: Sağlık Özeti

# ErrorOccurred
source: An error occurred.
tr: Bir hata oluştu.

source: Data not found.
tr: Veri bulunamadı.

source: Click for more details
tr: Daha fazla bilgi için tıklayınız

# createAccount
source: Create an Account
tr: Hesap Oluştur

source: Next
tr: İleri

# confirmMedicineTaken
source: Do you confirm you've taken this medicine?
tr: Bu ilacı aldığınızı onaylıyor musunuz?

# medicineAi
source: hat is the medicine? What does it do? What are its side effects? explain in english
tr: ilacı nedir? Ne işe yarar? Yan etkileri nelerdir? Türkçe açıkla

# measuresAi
source: What does it mean? What does it do? What are its benefits? What are its side effects? explain in english
tr: nedemek? Ne işe yarar? faydaliri nedir? Yan etkileri nelerdir? Türkçe açıkla

source: Complete
tr: Tamamla

# enterBasicInfo
source: Enter your basic information
tr: Temel bilgilerinizi giriniz

source: Back
tr: Geri

# provideHealthInfo
source: Provide information about your health status
tr: Sağlık durumunuz hakkında bilgi veriniz

# medicationFoodEnvironmental
source: Medication, food, environmental, etc.
tr: İlaç, gıda, çevresel vb.

# regularMedications
source: Medications you use regularly
tr: Düzenli kullandığınız ilaçlar

# reviewYourInfo
source: Review Your Information
tr: Bilgilerinizi Kontrol Edin

# checkAndComplete
source: You can review and complete the information you entered
tr: Girdiğiniz bilgileri kontrol edip tamamlayabilirsiniz

# birthDate
source: Date of Birth
tr: Doğum Tarihi

source: Not Specified
tr: Belirtilmedi

# acceptPrivacyPolicy
source: I accept the privacy policy and terms of use.
tr: Gizlilik politikasını ve kullanım şartlarını kabul ediyorum.

source: Read Terms
tr: Şartları oku

source: Medical Information
tr: Tıbbi Bilgiler

source: Your Genetic Health Profile
tr: Genetik Sağlık Profiliniz

source: Detailed Risks
tr: Detaylı Riskler

source: GENETIC MARKERS
tr: GENETİK İŞARETLEYİCİLER

# recommendationsDetailed
source: RECOMMENDATIONS
tr: ÖNERİLER

# unlockGeneticPotential
source: Unlock your genetic potential
tr: Genetik potansiyelinizin kilidini açın

source: Email
tr: E-posta

# enterEmail
source: Please enter your email
tr: Lütfen e-posta adresinizi girin

# validEmail
source: Please enter a valid email
tr: Geçerli bir e-posta adresi girin

source: Password
tr: Şifre

# passwordMinLength
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalıdır

source: Forgot password?
tr: Şifremi unuttum?

source: Login
tr: Giriş Yap

# noAccount
source: Don't have an account?
tr: Hesabınız yok mu?

source: Sign Up
tr: Üye Ol

source: or
tr: veya

# haveAccount
source: I have an account
tr: Hesabim var

source: Language
tr: Dil

# doYouHaveAccount
source: Do you have an account?
tr: Hesabın var mı?

source: requirement:
tr: İhtiyaç:

source: Language Selection
tr: Dil Seç

source: Change Password
tr: Şifre Değiştir

source: Password updated successfully
tr: Şifre başarıyla güncellendi

source: Current Password
tr: Mevcut Şifre

source: New Password
tr: Yeni Şifre

source: New Password (Repeat)
tr: Yeni Şifre (Tekrar)

source: Change
tr: Değiştir

source: App Icon Change
tr: Uygulama Simgesi Değiştir

# pleaseAcceptTerms
source: Please accept the terms.
tr: Lütfen şartları kabul ediniz.

source: No user session.
tr: Kullanıcı oturumu yok.

# infoSavedSuccessfully
source: Your information has been saved successfully.
tr: Bilgileriniz başarıyla kaydedildi.

source: An error occurred:
tr: Bir hata oluştu:

source: Male
tr: Erkek

source: Female
tr: Kadın

# otherGender
source: Other
tr: Diğer

source: Prefer not to say
tr: Belirtmek İstemiyorum

source: Caucasian
tr: Kafkas

source: African
tr: Afrikalı

source: Asian
tr: Asyalı

source: Hispanic
tr: Hispanik

# otherEthnicity
source: Other
tr: Diğer

source: Logout
tr: Çıkış Yap

# myPersonalInfo
source: My Personal Information
tr: Kişisel Bilgilerim

source: Profile not found
tr: Profil bulunamadı

source: My Information
tr: Bilgilerim

# medicalQuestionsPersonalDiseases
source: Please list any significant illnesses you have had and any chronic conditions you may have.
tr: Lütfen geçirmiş olduğunuz önemli hastalıkları ve varsa kronik rahatsızlıklarınızı yazınız.

# medicalQuestionsFamilyDiseases
source: Please indicate any genetic or serious illnesses observed in family members.
tr: Aile bireylerinde görülen genetik ya da ciddi hastalıkları belirtiniz.

# medicalQuestionsCurrentMedications
source: Please list any medications you are currently taking regularly.
tr: Şu anda düzenli olarak kullandığınız ilaçları belirtiniz.

# medicalQuestionsAllergies
source: Please indicate if you have any allergies to medications, foods, environmental factors (pollen, dust, etc.) or anything else.
tr: Herhangi bir ilaca, gıdaya, çevresel etkene (polen, toz vs.) veya başka bir şeye karşı alerjiniz varsa belirtiniz.

# greetingsWelcome
source: Hello, I'm AI!
tr: Merhaba, ben AI!

# greetingsPrompt
source: You can ask me your questions.
tr: Sorularınızı bana sorabilirsiniz.

source: Your Genetic Traits
tr: Genetik Özellikleriniz

# dnaAnalysisResults
source: Based on your DNA analysis results
tr: DNA analiz sonuçlarınıza göre

source: Detailed Analysis
tr: Detaylı Analiz

source: Description
tr: Açıklama

source: Prevalence
tr: Yaygınlık

source: Implications
tr: Etkileri

source: Global Distribution
tr: Küresel Dağılım

source: Taste Sensitivity Spectrum
tr: Tat Hassasiyeti Spektrumu

# dnaSequenceInquiry
source: Please share your DNA sequence.
tr: DNA sekans giriniz.

# analysisMayTakeTime
source: The analysis process may take some time. Please wait...
tr: Analiz işlemi biraz zaman alabilir. Lütfen bekleyiniz.

# dnaDataAnalyzing
source: Your DNA data is being analyzed...
tr: DNA verileriniz analiz ediliyor...

source: Genetic Traits Analysis
tr: Genetik Özellikler Analizi

source: Nutrition DNA Analysis
tr: Beslenme DNA Analizi

source: Health DNA Analysis
tr: Sağlık DNA Analizi

source: Fitness DNA Analysis
tr: Fitness DNA Analizi

# dnaAnalysis
source: DNA Analyse
tr: DNA Analizi

source: Analysis completed!
tr: Analiz tamamlandı!

source: preparing all reports...
tr: Tüm raporlar hazırlanıyor...

source: calculating results...
tr: sonuçlar hesaplanıyor...

# scanningPolymorphisms
source: ccanning polymorphisms...
tr: polimorfizmler taranıyor...

source: analyzing genetic markers...
tr: genetik markörler analiz ediliyor...

# fetchingDnaData
source: retrieving DNA data for...
tr: için DNA verileri alınıyor...

# finalizingReport
source: Finalizing your genetic report...
tr: Genetik raporunuz tamamlanıyor...
